In [1]:
import pandas as pd

data = pd.read_csv("API_EN.ATM.CO2E.PC_DS2_en_csv_v2_2917885.csv")

In [2]:
data.head()

,Country Name,Country Code,Indicator Name,Indicator Code,1960,1961,1962,1963,1964,1965,...,2011,2012,2013,2014,2015,2016,2017,2018,2019,2020
0,Aruba,ABW,CO2 emissions (metric tons per capita),EN.ATM.CO2E.PC,204.631696,208.837879,226.081890,214.785217,207.626699,185.213644,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,Africa Eastern and Southern,AFE,CO2 emissions (metric tons per capita),EN.ATM.CO2E.PC,0.906060,0.922474,0.930816,0.940570,0.996033,1.047280,...,1.005338,1.021646,1.031833,1.041145,0.987393,0.971016,0.959978,0.933541,NaN,NaN
2,Afghanistan,AFG,CO2 emissions (metric tons per capita),EN.ATM.CO2E.PC,0.046057,0.053589,0.073721,0.074161,0.086174,0.101285,...,0.407074,0.335351,0.263716,0.234037,0.232176,0.208857,0.203328,0.200151,NaN,NaN
3,Africa Western and Central,AFW,CO2 emissions (metric tons per capita),EN.ATM.CO2E.PC,0.090880,0.095283,0.096612,0.112376,0.133258,0.184803,...,0.497023,0.490867,0.504655,0.507671,0.480743,0.472959,0.476438,0.515544,NaN,NaN
4,Angola,AGO,CO2 emissions (metric tons per capita),EN.ATM.CO2E.PC,0.100835,0.082204,0.210533,0.202739,0.213562,0.205891,...,1.216317,1.204799,1.261542,1.285365,1.260921,1.227703,1.034317,0.887380,NaN,NaN

In [11]:
new = pd.melt(data,id_vars=data.columns[:4].values,var_name='Year', value_name='CO2 Emission')
new.head()

,Country Name,Country Code,Indicator Name,Indicator Code,Year,CO2 Emission
0,Aruba,ABW,CO2 emissions (metric tons per capita),EN.ATM.CO2E.PC,1960,204.631696
1,Africa Eastern and Southern,AFE,CO2 emissions (metric tons per capita),EN.ATM.CO2E.PC,1960,0.906060
2,Afghanistan,AFG,CO2 emissions (metric tons per capita),EN.ATM.CO2E.PC,1960,0.046057
3,Africa Western and Central,AFW,CO2 emissions (metric tons per capita),EN.ATM.CO2E.PC,1960,0.090880
4,Angola,AGO,CO2 emissions (metric tons per capita),EN.ATM.CO2E.PC,1960,0.100835

In [4]:
data = pd.read_csv("co2_long.csv")
data.head()

,Country Name,Country Code,Indicator Name,Indicator Code,Year,CO2 Emission
0,Aruba,ABW,CO2 emissions (metric tons per capita),EN.ATM.CO2E.PC,1960,204.631696
1,Africa Eastern and Southern,AFE,CO2 emissions (metric tons per capita),EN.ATM.CO2E.PC,1960,0.906060
2,Afghanistan,AFG,CO2 emissions (metric tons per capita),EN.ATM.CO2E.PC,1960,0.046057
3,Africa Western and Central,AFW,CO2 emissions (metric tons per capita),EN.ATM.CO2E.PC,1960,0.090880
4,Angola,AGO,CO2 emissions (metric tons per capita),EN.ATM.CO2E.PC,1960,0.100835

In [6]:
data.groupby(["Year", "Country Name"]).sum()

                                  CO2 Emission
Year Country Name
1960 Afghanistan                      0.046057
     Africa Eastern and Southern      0.906060
     Africa Western and Central       0.090880
     Albania                          1.258195
     Algeria                          0.557120
...                                        ...
2020 West Bank and Gaza               0.000000
     World                            0.000000
     Yemen, Rep.                      0.000000
     Zambia                           0.000000
     Zimbabwe                         0.000000

[16226 rows x 1 columns]

In [1]:
import pandas as pd

data = pd.read_csv("summed_by_country.csv")

In [2]:
data.head()

   Year                 Country Name  CO2 Emission
0  1960                  Afghanistan      0.046057
1  1960  Africa Eastern and Southern      0.906060
2  1960   Africa Western and Central      0.090880
3  1960                      Albania      1.258195
4  1960                      Algeria      0.557120

In [3]:
new = data.groupby("Year").sum().reset_index()

In [5]:
new["Country Name"] = "All"

In [8]:
a = pd.concat([data, new])

In [11]:
a[["CO2 Emission"]] = a[["CO2 Emission"]].apply(pd.to_numeric)

In [13]:
a.loc[a.Year<=2018]

    Year                 Country Name  CO2 Emission
0   1960                  Afghanistan      0.046057
1   1960  Africa Eastern and Southern      0.906060
2   1960   Africa Western and Central      0.090880
3   1960                      Albania      1.258195
4   1960                      Algeria      0.557120
..   ...                          ...           ...
54  2014                          All   1002.769858
55  2015                          All    991.580786
56  2016                          All    991.156993
57  2017                          All    992.850229
58  2018                          All    993.908458

[15753 rows x 3 columns]

In [14]:
a.to_csv("summed_by_country_acc.csv")

In [1]:
import pandas as pd

data = pd.read_csv("Environment_Temperature_change_E_All_Data_NOFLAG.csv")

In [2]:
data.head()

,Area Code,Area,Months Code,Months,Element Code,Element,Unit,Y1961,Y1962,Y1963,...,Y2010,Y2011,Y2012,Y2013,Y2014,Y2015,Y2016,Y2017,Y2018,Y2019
0,2,Afghanistan,7001,January,7271,Temperature change,�C,0.777,0.062,2.744,...,3.601,1.179,-0.583,1.233,1.755,1.943,3.416,1.201,1.996,2.951
1,2,Afghanistan,7001,January,6078,Standard Deviation,�C,1.950,1.950,1.950,...,1.950,1.950,1.950,1.950,1.950,1.950,1.950,1.950,1.950,1.950
2,2,Afghanistan,7002,February,7271,Temperature change,�C,-1.743,2.465,3.919,...,1.212,0.321,-3.201,1.494,-3.187,2.699,2.251,-0.323,2.705,0.086
3,2,Afghanistan,7002,February,6078,Standard Deviation,�C,2.597,2.597,2.597,...,2.597,2.597,2.597,2.597,2.597,2.597,2.597,2.597,2.597,2.597
4,2,Afghanistan,7003,March,7271,Temperature change,�C,0.516,1.336,0.403,...,3.390,0.748,-0.527,2.246,-0.076,-0.497,2.296,0.834,4.418,0.234

In [6]:
new = data[["Area", "Months", "Element"]+["Y"+str(i) for i in range(1961,2020)]]

In [9]:
new.columns = ["Area", "Months", "Element"]+[str(i) for i in range(1961,2020)]

In [18]:
final = new.loc[(new.Element=="Temperature change") & (new.Months=="Meteorological year")].drop(["Months", "Element"], axis=1)

In [ ]:
final.to_csv("yearly_consumption_by_")